[{"data":1,"prerenderedAt":266},["ShallowReactive",2],{"blog_post":3,"content-query-sZNKNPKdpx":148,"navigation":245},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":7,"date":9,"body":10,"_type":142,"_id":143,"_source":144,"_file":145,"_stem":146,"_extension":147},"/blog/2018-05-14-how_technical_interviews_work","blog",false,"","How Technical Interviews Work","May 14 2018",{"type":11,"children":12,"toc":130},"root",[13,21,26,33,40,45,50,56,61,67,72,78,83,88,93,99,104,109,114,119,125],{"type":14,"tag":15,"props":16,"children":17},"element","p",{},[18],{"type":19,"value":20},"text","There is a lot of information out there regarding technical interviews and\nthese guides are much better at advice than I can ever give. The main one I can\nrecommend is “Cracking the Coding Interview”; it is an invaluable resource\nwhile preparing for these interviews.",{"type":14,"tag":15,"props":22,"children":23},{},[24],{"type":19,"value":25},"That said, I wanted to give a quick rundown of what I know about the interview\nprocess based on personal experience.",{"type":14,"tag":27,"props":28,"children":30},"h2",{"id":29},"the-overall-process",[31],{"type":19,"value":32},"The overall process ",{"type":14,"tag":34,"props":35,"children":37},"h3",{"id":36},"automated-resume-screening",[38],{"type":19,"value":39},"Automated resume screening",{"type":14,"tag":15,"props":41,"children":42},{},[43],{"type":19,"value":44},"Most people will apply online to these companies and submit their resume for an\nautomatic review process. People suggest that using a difficult to understand\nformat (for a machine) for your resume is a bad idea. There is probably some\nkeyword matching and some ML thrown in there. Regardless, I dont think there\nis much you can do to optimize your resume for this step. Make a good resume\n(for a human reviewer) and that should be good enough for the algorithm as well.",{"type":14,"tag":15,"props":46,"children":47},{},[48],{"type":19,"value":49},"If you can get a referral into the company, you can skip this step altogether.\nTake a look at my post about how-referrals-work for a detailed explaination.",{"type":14,"tag":34,"props":51,"children":53},{"id":52},"recruiter-resume-screening",[54],{"type":19,"value":55},"Recruiter resume screening",{"type":14,"tag":15,"props":57,"children":58},{},[59],{"type":19,"value":60},"Similar to the above, having an objectively good resume is the way to go here.\nLook up some guides on good resume practices. Take a look at eye movement heat\nmaps for recruiters, it really puts things into perspective.",{"type":14,"tag":34,"props":62,"children":64},{"id":63},"online-testquiz",[65],{"type":19,"value":66},"Online test/quiz",{"type":14,"tag":15,"props":68,"children":69},{},[70],{"type":19,"value":71},"This is usually just a very preliminary weeding out process. Take a look at\nGoogle Code Jam questions for some examples and a basic idea of the difficulty\nlevel. You typically get 2 questions and 2+ hours to solve them. I believe most\npeople with reasonable programming skills should be able to solve these\nquestions. If you cannot solve these in 2 hours without the pressure of an\nactual interview, you really need to brush up your programming/problem solving\nskills.",{"type":14,"tag":34,"props":73,"children":75},{"id":74},"technical-interviews-2-for-internship-45-for-full-time",[76],{"type":19,"value":77},"Technical interviews (2 for internship, 4/5 for full time)",{"type":14,"tag":15,"props":79,"children":80},{},[81],{"type":19,"value":82},"This is the most important step of the entire process, and the one most people\nfail at. I feel there is no subsitute for practice through actual interviews\nand mock interviews for this. No amount of coding problems or programming\ncompetitions will prepare you for ‘interviewing’ well. For that you need to be\ncomfortable not only approaching the problem well and solving it, but also\nspeaking out loud all through it.",{"type":14,"tag":15,"props":84,"children":85},{},[86],{"type":19,"value":87},"Remember the process of solving a problem is more important than the actual\nsolution to the interviewer. They already checked that you can solve programming\nproblems in the online quiz. Now they are trying to judge you on a different\nscale. If you stay quiet for 5-10 miutes and come up with the optimal solution,\nthe interviewer will probably not be impressed. What’s better is to spend\n10-15 minutes discussing the problem at hand and possible solution with the\ninterviewer and making sure you get to the solution with the interviewer in\ntow, not just inform them when you are done.",{"type":14,"tag":15,"props":89,"children":90},{},[91],{"type":19,"value":92},"Hopefully, a good set of mock interviews early enough should tell you about\nyour weak areas and you can work on them. I can only give a general set of tips\non stuff that I feel people commonly miss out on.",{"type":14,"tag":34,"props":94,"children":96},{"id":95},"a-interview-can-have-one-or-two-questions-often-there-is-one-standard",[97],{"type":19,"value":98},"A interview can have one or two questions. Often there is one standard",{"type":14,"tag":15,"props":100,"children":101},{},[102],{"type":19,"value":103},"programming question and then one system design question (sometimes this is\nskipped for interns). In other cases, the interviewer will give you a simple\nquestion and then once you’re done with it, they will introduce some special\ncase or variation to see how you adapt to changing requirements. Learn to\nproperly judge which kind of question the interviewer is asking and time\nyourself correctly.Related to the above, don’t lose track of time.\nThat doesn’t mean that you keep freaking out about the ticking clock, but don’t\nkeep talking and talking until there are 5 minutes left in the interview.\nSet a time limit to when you will begin writing code. Judge how much\ntime the interviewer expects you to spend on a question (see above), and spend\nat most 30-40 percent discussing possible solutions. For example, in a 1 hour\ninterview if you feel the question is 30 minutes long, decide to start writing\ncode on the board at the 10 minutes mark. Expect to spend 10 minutes writing\ncode, and then 10 more minutes running tests and discussing runtime.\nDon’t jump to the best/optimal solution immediately. Even if you know what the\nbest solution is, it’s best to mention the brute force or suboptimal\nsolutions (no matter how obvious they seem to you), and then quickly also\ntell them why you rejected those. That will tell the interviewer you know\nexactly why the solution you come up with is the best.That said, if you\ncan’t come up with a solution you think is optimal, don’t waste all the\ninterview discussing/thinking about it. An implemented suboptimal solution\nis many times better than a unimplemented optimal one.If on a board, write\ndown the question/details as the interviewer tells you. Write down everything\nyou think is important. Learn to ask questions that will define the problem\nmore, for example if the input will only be integers, the ranges etc. This\nwill give you time where you can keep talking slightly ‘mindlessly’ and\nyou can think in advance about the solutions.Write down test cases before\nanything else. No need to write working code for test cases. Stuff like\nfoo(“input”) => “expected_output” is completely fine. This will ensure\nyou have a starting point for the logic as well as ensure that you and\nthe interviewer are on the same page regarding the problem.Write down\ntest cases for each corner case. I cannot emphasise how important good\ntest cases are. Writing test cases first and dry running them before\ntelling the interviewer you are done will automatically put you ahead of\nmost people. Interviewers love Test-Driven-Developement.Practice\ntalking out loud when thinking about the problem at the same time. Most people\nare used to being left alone and staring at the screen in silence and then comng\nup with a solution. That doesn’t work in an interview. Don’t be silent for more\nthan 5-7 seconds. Even when writing code keep talking about what it does.\nBonus points if you relate it to the test cases you wrote in the start, for\nexample “This if condition handles the base case tested in that test case…”.\nStart running the test cases on your own when you feel you are done. Don’t\nwait for the interviewer to tell you to test your code. The same goes for\nruntime. Once you are done with the test cases, discuss the runtime (talk\nwith the interviewer and take him through how you figure out the runtime for\nyour solution), and then write it down in Big-O notation.If the interviewer\nsays ANYTHING when you are writing the code or discussing test cases or\npossible solutions, take careful note of it. Nothing an interviewer says is\nuseless. It is more often than not a carefully thought out comment to point\nout some mistake or to nudge you in the correct direction.If you are\ncompletely blank and cannot think of any solution, starting running the\nproblem through the data structures you know and try to find if there is any\nwhich has a special property which makes the solution obvious. Most problems\nare actually just applying the proper data structure.Team matching",{"type":14,"tag":15,"props":105,"children":106},{},[107],{"type":19,"value":108},"This is the good part. You have cleared the technical interviews and are deemed\nfit for hire by the company. Now you will be added to the pool of accepted\ncandidates and team with open positions can review your interests/skills and\ncontact you for a chat if they think there’s a match.",{"type":14,"tag":15,"props":110,"children":111},{},[112],{"type":19,"value":113},"How many teams you are contacted by/can talk to depends on the office you are\napplying to. A bigger office means you get more choice with deciding. Sometimes\nyou only get one shot at a team matching interview, so don’t be too picky, but\ndon’t sign up to work with a team you absolutely have nothing in common with.",{"type":14,"tag":15,"props":115,"children":116},{},[117],{"type":19,"value":118},"This step might be skipped if you are converting from an intern position to full\ntime and your team specifically requested to hire you, or if you were hand\npicked from the industry for a specific team.",{"type":14,"tag":34,"props":120,"children":122},{"id":121},"offer",[123],{"type":19,"value":124},"Offer",{"type":14,"tag":15,"props":126,"children":127},{},[128],{"type":19,"value":129},"Congratulations, it is time for offer. Once a team has agreed to hire you, and\nyou have indicated that you want to join them as well, your recruiter will\ndiscuss the offer with you. There is room for negotiations, but it depends a\nlot on your background and other competing offers. If you are a fresh grad with\nno other competing offers from a similar big company, you don’t have much room\nfor negotiation.",{"title":7,"searchDepth":131,"depth":131,"links":132},2,[133],{"id":29,"depth":131,"text":32,"children":134},[135,137,138,139,140,141],{"id":36,"depth":136,"text":39},3,{"id":52,"depth":136,"text":55},{"id":63,"depth":136,"text":66},{"id":74,"depth":136,"text":77},{"id":95,"depth":136,"text":98},{"id":121,"depth":136,"text":124},"markdown","content:blog:2018-05-14-how_technical_interviews_work.md","content","blog/2018-05-14-how_technical_interviews_work.md","blog/2018-05-14-how_technical_interviews_work","md",{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":7,"date":9,"body":149,"_type":142,"_id":143,"_source":144,"_file":145,"_stem":146,"_extension":147},{"type":11,"children":150,"toc":235},[151,155,159,163,167,171,175,179,183,187,191,195,199,203,207,211,215,219,223,227,231],{"type":14,"tag":15,"props":152,"children":153},{},[154],{"type":19,"value":20},{"type":14,"tag":15,"props":156,"children":157},{},[158],{"type":19,"value":25},{"type":14,"tag":27,"props":160,"children":161},{"id":29},[162],{"type":19,"value":32},{"type":14,"tag":34,"props":164,"children":165},{"id":36},[166],{"type":19,"value":39},{"type":14,"tag":15,"props":168,"children":169},{},[170],{"type":19,"value":44},{"type":14,"tag":15,"props":172,"children":173},{},[174],{"type":19,"value":49},{"type":14,"tag":34,"props":176,"children":177},{"id":52},[178],{"type":19,"value":55},{"type":14,"tag":15,"props":180,"children":181},{},[182],{"type":19,"value":60},{"type":14,"tag":34,"props":184,"children":185},{"id":63},[186],{"type":19,"value":66},{"type":14,"tag":15,"props":188,"children":189},{},[190],{"type":19,"value":71},{"type":14,"tag":34,"props":192,"children":193},{"id":74},[194],{"type":19,"value":77},{"type":14,"tag":15,"props":196,"children":197},{},[198],{"type":19,"value":82},{"type":14,"tag":15,"props":200,"children":201},{},[202],{"type":19,"value":87},{"type":14,"tag":15,"props":204,"children":205},{},[206],{"type":19,"value":92},{"type":14,"tag":34,"props":208,"children":209},{"id":95},[210],{"type":19,"value":98},{"type":14,"tag":15,"props":212,"children":213},{},[214],{"type":19,"value":103},{"type":14,"tag":15,"props":216,"children":217},{},[218],{"type":19,"value":108},{"type":14,"tag":15,"props":220,"children":221},{},[222],{"type":19,"value":113},{"type":14,"tag":15,"props":224,"children":225},{},[226],{"type":19,"value":118},{"type":14,"tag":34,"props":228,"children":229},{"id":121},[230],{"type":19,"value":124},{"type":14,"tag":15,"props":232,"children":233},{},[234],{"type":19,"value":129},{"title":7,"searchDepth":131,"depth":131,"links":236},[237],{"id":29,"depth":131,"text":32,"children":238},[239,240,241,242,243,244],{"id":36,"depth":136,"text":39},{"id":52,"depth":136,"text":55},{"id":63,"depth":136,"text":66},{"id":74,"depth":136,"text":77},{"id":95,"depth":136,"text":98},{"id":121,"depth":136,"text":124},[246,257,261],{"title":247,"_path":248,"children":249},"Blog","/blog",[250,253,254],{"title":251,"_path":252},"How Referrals Work","/blog/2018-05-13-how_referrals_work",{"title":8,"_path":4},{"title":255,"_path":256},"Rebuilding JehangirKazi.com from scratch","/blog/2024-09-20-rebuilding_jehangirkazi_com",{"title":258,"_path":259,"icon":260},"Home","/","🏡",{"title":262,"_path":263,"children":264},"Wiki","/wiki",[265],{"title":262,"_path":263},1726969853375]